"""
从中央气象台雷达图中提取除去背景后的雷达图
"""
import numpy as np
import cv2
# 10, 15, 20, 25 / 30, 35, 40, 45 / 50, 55, 60, 65 / 70 RBG(雷达拼图)
# 可能是因为png/jpg压缩的问题，rgb对应像素可能值上下有1个像素点的浮动
_color_map_dbz = [(1, 160, 246), (0, 236, 236), (0, 216, 0), (1, 144, 0),
                  (255, 255, 0), (231, 192, 0), (255, 144, 0), (255, 0, 0),
                  (214, 0, 0), (192, 0, 0), (255, 0, 240), (150, 0, 180),
                  (173, 144, 240)]
_color_river = (190, 232, 255)  # 江的RGB
_color_word = (104, 104, 104)  # 字体的RGB  待填充部分
_color_pr_edge = (156, 156, 156)  # 省份边界RGB
_color_city_edge = (204, 204, 204)  # 市边界RBG

# 单站雷达
# 5, 10, 15, 20
_color_dbz_single = [(0, 0, 246), (1, 160, 246), (0, 236, 236), (1, 255, 0),
                     (0, 200, 0), (1, 144, 0), (255, 255, 0), (231, 192, 0),
                     (255, 144, 0), (255, 0, 0), (214, 0, 0), (192, 0, 0),
                     (255, 0, 240), (120, 0, 132), (173, 144, 240)]
_color_pr_edge_single = (168, 168, 168)
_color_city_edge_single = (178, 178, 178)



# 灰度的区域一般来说 RGB的方差会很小，这里用绝对差异进行过滤 阈值暂定为20
#### temp 




############